Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/atdf/ATSAMV71N21.atdf
        <module name="UTMI" id="11300" version="A">
          <instance name="UTMI">
            <register-group address-space="base" name="UTMI" name-in-module="UTMI" offset="0x400E0400"/>
          </instance>
        </module>
        <module name="WDT" id="6080" version="M">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1850"/>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="XDMAC" id="11161" version="H">
          <instance name="XDMAC">
            <register-group address-space="base" name="XDMAC" name-in-module="XDMAC" offset="0x40078000"/>
            <parameters>
              <param name="INSTANCE_ID" value="58"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="1" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="1" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
        <module name="SCnSCB"> <!-- System control Register not in SCB -->
            <instance name="SCnSCB">
                <register-group address-space="base" offset="0xE000E000" name-in-module="SCnSCB" name="SCnSCB"/>
            </instance>
        </module><module name="SCB">
            <instance name="SCB" oldname="SystemControl">
                <register-group address-space="base" offset="0xE000ED00" name-in-module="SCB" name="SCB"/>
            </instance>
        </module>
        <module name="SysTick">
            <instance name="SysTick">
                <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
            </instance>
        </module>
        <module name="NVIC">
            <instance name="NVIC">
                <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
            </instance>
        </module>
        <module name="MPU">
            <instance name="MPU">
                <register-group address-space="base" offset="0xE000ED90" name-in-module="MPU" name="MPU"/>
            </instance>
        </module>
        <module name="FPU">
            <instance name="FPU">
                <register-group address-space="base" offset="0xE000EF30" name-in-module="FPU" name="FPU"/>
            </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt index="-15" name="Reset" caption="Reset Vector, invoked on Power up and warm reset"/>
        <interrupt index="-14" name="NonMaskableInt" caption="Non maskable Interrupt, cannot be stopped or preempted"/>
        <interrupt index="-13" name="HardFault" caption="Hard Fault, all classes of Fault"/>
        <interrupt index="-12" name="MemoryManagement" caption="Memory Management, MPU mismatch, including Access Violation and No Match"/>
        <interrupt index="-11" name="BusFault" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"/>
        <interrupt index="-10" name="UsageFault" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition"/>
        <interrupt index="-5" name="SVCall" caption="System Service Call via SVC instruction"/>
        <interrupt index="-4" name="DebugMonitor" caption="Debug Monitor"/>
        <interrupt index="-2" name="PendSV" caption="Pendable request for system service"/>
        <interrupt index="-1" name="SysTick" caption="System Tick Timer"/>
        <interrupt index="0" module-instance="SUPC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="RSTC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="RTC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="RTT" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="WDT" name="WDT" caption="Watchdog Timer"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="EFC" name="EFC" caption="Enhanced Embedded Flash Controller"/>
        <interrupt index="7" module-instance="UART0" name="UART0" caption="UART 0"/>
        <interrupt index="8" module-instance="UART1" name="UART1" caption="UART 1"/>
        <interrupt index="10" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller A"/>
        <interrupt index="11" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller B"/>
        <interrupt index="13" module-instance="USART0" name="USART0" caption="USART 0"/>
        <interrupt index="14" module-instance="USART1" name="USART1" caption="USART 1"/>
        <interrupt index="15" module-instance="USART2" name="USART2" caption="USART 2"/>
        <interrupt index="16" module-instance="PIOD" name="PIOD" caption="Parallel I/O Controller D"/>
        <interrupt index="18" module-instance="HSMCI" name="HSMCI" caption="Multimedia Card Interface"/>
        <interrupt index="19" module-instance="TWIHS0" name="TWIHS0" caption="Two Wire Interface 0 HS"/>
        <interrupt index="20" module-instance="TWIHS1" name="TWIHS1" caption="Two Wire Interface 1 HS"/>
        <interrupt index="21" module-instance="SPI0" name="SPI0" caption="Serial Peripheral Interface 0"/>
        <interrupt index="22" module-instance="SSC" name="SSC" caption="Synchronous Serial Controller"/>
        <interrupt index="23" module-instance="TC0" name="TC0" caption="Timer/Counter 0"/>
        <interrupt index="24" module-instance="TC0" name="TC1" caption="Timer/Counter 1"/>
        <interrupt index="25" module-instance="TC0" name="TC2" caption="Timer/Counter 2"/>
        <interrupt index="26" module-instance="TC1" name="TC3" caption="Timer/Counter 3"/>
        <interrupt index="27" module-instance="TC1" name="TC4" caption="Timer/Counter 4"/>
        <interrupt index="28" module-instance="TC1" name="TC5" caption="Timer/Counter 5"/>
        <interrupt index="29" module-instance="AFEC0" name="AFEC0" caption="Analog Front End 0"/>
        <interrupt index="31" module-instance="PWM0" name="PWM0" caption="Pulse Width Modulation 0"/>
        <interrupt index="32" module-instance="ICM" name="ICM" caption="Integrity Check Monitor"/>
        <interrupt index="33" module-instance="ACC" name="ACC" caption="Analog Comparator"/>
        <interrupt index="34" module-instance="USBHS" name="USBHS" caption="USB Host / Device Controller"/>
        <interrupt index="35" module-instance="MCAN0" name="MCAN0_INT0" caption="MCAN Controller 0 Interrupt 0"/>
        <interrupt index="36" module-instance="MCAN0" name="MCAN0_INT1" caption="MCAN Controller 0 Interrupt 1"/>
        <interrupt index="37" module-instance="MCAN1" name="MCAN1_INT0" caption="MCAN Controller 1 Interrupt 0"/>
        <interrupt index="38" module-instance="MCAN1" name="MCAN1_INT1" caption="MCAN Controller 1 Interrupt 1"/>
        <interrupt index="39" module-instance="GMAC" name="GMAC" caption="Ethernet MAC"/>
        <interrupt index="40" module-instance="AFEC1" name="AFEC1" caption="Analog Front End 1"/>
        <interrupt index="41" module-instance="TWIHS2" name="TWIHS2" caption="Two Wire Interface 2 HS"/>
        <interrupt index="43" module-instance="QSPI" name="QSPI" caption="Quad I/O Serial Peripheral Interface"/>
        <interrupt index="44" module-instance="UART2" name="UART2" caption="UART 2"/>
        <interrupt index="45" module-instance="UART3" name="UART3" caption="UART 3"/>
        <interrupt index="46" module-instance="UART4" name="UART4" caption="UART 4"/>
        <interrupt index="47" module-instance="TC2" name="TC6" caption="Timer/Counter 6"/>
        <interrupt index="48" module-instance="TC2" name="TC7" caption="Timer/Counter 7"/>
        <interrupt index="49" module-instance="TC2" name="TC8" caption="Timer/Counter 8"/>
        <interrupt index="50" module-instance="TC3" name="TC9" caption="Timer/Counter 9"/>
        <interrupt index="51" module-instance="TC3" name="TC10" caption="Timer/Counter 10"/>
        <interrupt index="52" module-instance="TC3" name="TC11" caption="Timer/Counter 11"/>
        <interrupt index="53" module-instance="MLB" name="MLB" caption="MediaLB"/>
        <interrupt index="56" module-instance="AES" name="AES" caption="AES"/>
        <interrupt index="57" module-instance="TRNG" name="TRNG" caption="True Random Generator"/>
        <interrupt index="58" module-instance="XDMAC" name="XDMAC" caption="DMA"/>
        <interrupt index="59" module-instance="ISI" name="ISI" caption="Camera Interface"/>
        <interrupt index="60" module-instance="PWM1" name="PWM1" caption="Pulse Width Modulation 1"/>
        <interrupt index="61" module-instance="FPU" name="FPU" caption="Floating Point Unit"/>
        <interrupt index="63" module-instance="RSWDT" name="RSWDT" caption="Reinforced Secure Watchdog Timer"/>
        <interrupt index="64" module-instance="SystemControl" name="CCW" caption="Cache ECC Warning"/>
        <interrupt index="65" module-instance="SystemControl" name="CCF" caption="Cache ECC Fault"/>
        <interrupt index="66" module-instance="GMAC" name="GMAC_Q1" caption="GMAC Queue 1"/>
        <interrupt index="67" module-instance="GMAC" name="GMAC_Q2" caption="GMAC Queue 2"/>
        <interrupt index="68" module-instance="FPU" name="IXC" caption="Floating Point Unit IXC"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
    </device>
  </devices>
  <modules>
    <module name="ACC" caption="Analog Comparator Controller" id="6490" version="H">
      <register-group name="ACC">
        <register caption="Control Register" name="ACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="ACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Selection for Minus Comparator Input" mask="0x00000007" name="SELMINUS" values="ACC_MR__SELMINUS"/>
          <bitfield caption="Selection For Plus Comparator Input" mask="0x00000070" name="SELPLUS" values="ACC_MR__SELPLUS"/>
          <bitfield caption="Analog Comparator Enable" mask="0x00000100" name="ACEN" values="ACC_MR__ACEN"/>
          <bitfield caption="Edge Type" mask="0x00000600" name="EDGETYP" values="ACC_MR__EDGETYP"/>
          <bitfield caption="Invert Comparator Output" mask="0x00001000" name="INV" values="ACC_MR__INV"/>
          <bitfield caption="Selection Of Fault Source" mask="0x00002000" name="SELFS" values="ACC_MR__SELFS"/>
          <bitfield caption="Fault Enable" mask="0x00004000" name="FE" values="ACC_MR__FE"/>
        </register>
        <register caption="Interrupt Enable Register" name="ACC_IER" offset="0x24" rw="W" size="4" atomic-op="set:ACC_IMR">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Disable Register" name="ACC_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:ACC_IMR">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Mask Register" name="ACC_IMR" offset="0x2C" rw="R" size="4" atomic-op="read:ACC_IMR">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Status Register" name="ACC_ISR" offset="0x30" rw="R" size="4" atomic-op="clear:ACC_ISR">
          <bitfield caption="Comparison Edge (cleared on read)" mask="0x00000001" name="CE"/>
          <bitfield caption="Synchronized Comparator Output" mask="0x00000002" name="SCO"/>
          <bitfield caption="Flag Mask" mask="0x80000000" name="MASK"/>
        </register>
        <register caption="Analog Control Register" name="ACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Current Selection" mask="0x00000001" name="ISEL" values="ACC_ACR__ISEL"/>
          <bitfield caption="Hysteresis Selection" mask="0x00000006" name="HYST"/>
        </register>
        <register caption="Write Protection Mode Register" name="ACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="ACC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
        </register>
        <register caption="Version Register" name="ACC_VER" offset="0xFC" rw="R" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
      </register-group>
