Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/atdf/ATSAMV71N21.atdf
        <register caption="PTP Peer Event Frame Received Nanoseconds Register" name="GMAC_PEFRN" offset="0x1FC" rw="R" size="4">
          <bitfield caption="Register Update" mask="0x3FFFFFFF" name="RUD"/>
        </register>
        <register caption="Interrupt Status Register Priority Queue (index = 1) 0" name="GMAC_ISRPQ" offset="0x3FC" rw="R" size="4" count="2" atomic-op="clear:GMAC_ISRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address Register Priority Queue (index = 1) 0" name="GMAC_TBQBAPQ" offset="0x43C" rw="RW" size="4" count="2">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0xFFFFFFFC" name="TXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Register Priority Queue (index = 1) 0" name="GMAC_RBQBAPQ" offset="0x47C" rw="RW" size="4" count="2">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0xFFFFFFFC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue (index = 1) 0" name="GMAC_RBSRPQ" offset="0x49C" rw="RW" size="4" count="2">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Credit-Based Shaping Control Register" name="GMAC_CBSCR" offset="0x4BC" rw="RW" size="4">
          <bitfield caption="Queue B CBS Enable" mask="0x00000001" name="QBE"/>
          <bitfield caption="Queue A CBS Enable" mask="0x00000002" name="QAE"/>
        </register>
        <register caption="Credit-Based Shaping IdleSlope Register for Queue A" name="GMAC_CBSISQA" offset="0x4C0" rw="RW" size="4">
          <bitfield caption="IdleSlope" mask="0xFFFFFFFF" name="IS"/>
        </register>
        <register caption="Credit-Based Shaping IdleSlope Register for Queue B" name="GMAC_CBSISQB" offset="0x4C4" rw="RW" size="4">
          <bitfield caption="IdleSlope" mask="0xFFFFFFFF" name="IS"/>
        </register>
        <register caption="Screening Type 1 Register Priority Queue (index = 0) 0" name="GMAC_ST1RPQ" offset="0x500" rw="RW" size="4" count="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type 2 Register Priority Queue (index = 0) 0" name="GMAC_ST2RPQ" offset="0x540" rw="RW" size="4" count="8">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x00000070" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
          <bitfield caption="Index of Screening Type 2 EtherType register x" mask="0x00000E00" name="I2ETH"/>
          <bitfield caption="EtherType Enable" mask="0x00001000" name="ETHE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x0003E000" name="COMPA"/>
          <bitfield caption="Compare A Enable" mask="0x00040000" name="COMPAE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x00F80000" name="COMPB"/>
          <bitfield caption="Compare B Enable" mask="0x01000000" name="COMPBE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x3E000000" name="COMPC"/>
          <bitfield caption="Compare C Enable" mask="0x40000000" name="COMPCE"/>
        </register>
        <register caption="Interrupt Enable Register Priority Queue (index = 1) 0" name="GMAC_IERPQ" offset="0x5FC" rw="W" size="4" count="2" atomic-op="set:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Disable Register Priority Queue (index = 1) 0" name="GMAC_IDRPQ" offset="0x61C" rw="W" size="4" count="2" atomic-op="clear:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Mask Register Priority Queue (index = 1) 0" name="GMAC_IMRPQ" offset="0x63C" rw="RW" size="4" count="2" atomic-op="read:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="AHB Error" mask="0x00000040" name="AHB"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
