Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/atdf/ATSAMV71N21.atdf
        <register caption="Interrupt Enable Register" name="RTC_IER" offset="0x20" rw="W" size="4" atomic-op="set:RTC_IMR">
          <bitfield caption="Acknowledge Update Interrupt Enable" mask="0x00000001" name="ACKEN"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00000002" name="ALREN"/>
          <bitfield caption="Second Event Interrupt Enable" mask="0x00000004" name="SECEN"/>
          <bitfield caption="Time Event Interrupt Enable" mask="0x00000008" name="TIMEN"/>
          <bitfield caption="Calendar Event Interrupt Enable" mask="0x00000010" name="CALEN"/>
          <bitfield caption="Time and/or Date Error Interrupt Enable" mask="0x00000020" name="TDERREN"/>
        </register>
        <register caption="Interrupt Disable Register" name="RTC_IDR" offset="0x24" rw="W" size="4" atomic-op="clear:RTC_IMR">
          <bitfield caption="Acknowledge Update Interrupt Disable" mask="0x00000001" name="ACKDIS"/>
          <bitfield caption="Alarm Interrupt Disable" mask="0x00000002" name="ALRDIS"/>
          <bitfield caption="Second Event Interrupt Disable" mask="0x00000004" name="SECDIS"/>
          <bitfield caption="Time Event Interrupt Disable" mask="0x00000008" name="TIMDIS"/>
          <bitfield caption="Calendar Event Interrupt Disable" mask="0x00000010" name="CALDIS"/>
          <bitfield caption="Time and/or Date Error Interrupt Disable" mask="0x00000020" name="TDERRDIS"/>
        </register>
        <register caption="Interrupt Mask Register" name="RTC_IMR" offset="0x28" rw="R" size="4" atomic-op="read:RTC_IMR">
          <bitfield caption="Acknowledge Update Interrupt Mask" mask="0x00000001" name="ACK"/>
          <bitfield caption="Alarm Interrupt Mask" mask="0x00000002" name="ALR"/>
          <bitfield caption="Second Event Interrupt Mask" mask="0x00000004" name="SEC"/>
          <bitfield caption="Time Event Interrupt Mask" mask="0x00000008" name="TIM"/>
          <bitfield caption="Calendar Event Interrupt Mask" mask="0x00000010" name="CAL"/>
          <bitfield caption="Time and/or Date Error Mask" mask="0x00000020" name="TDERR"/>
        </register>
        <register caption="Valid Entry Register" name="RTC_VER" offset="0x2C" rw="R" size="4">
          <bitfield caption="Non-valid Time" mask="0x00000001" name="NVTIM"/>
          <bitfield caption="Non-valid Calendar" mask="0x00000002" name="NVCAL"/>
          <bitfield caption="Non-valid Time Alarm" mask="0x00000004" name="NVTIMALR"/>
          <bitfield caption="Non-valid Calendar Alarm" mask="0x00000008" name="NVCALALR"/>
        </register>
        <register caption="Version Register" name="RTC_VERSION" offset="0xFC" rw="R" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
      </register-group>
      <value-group caption="" name="RTC_CR__TIMEVSEL">
        <value caption="Minute change" name="MINUTE" value="0x0"/>
        <value caption="Hour change" name="HOUR" value="0x1"/>
        <value caption="Every day at midnight" name="MIDNIGHT" value="0x2"/>
        <value caption="Every day at noon" name="NOON" value="0x3"/>
      </value-group>
      <value-group caption="" name="RTC_CR__CALEVSEL">
        <value caption="Week change (every Monday at time 00:00:00)" name="WEEK" value="0x0"/>
        <value caption="Month change (every 01 of each month at time 00:00:00)" name="MONTH" value="0x1"/>
        <value caption="Year change (every January 1 at time 00:00:00)" name="YEAR" value="0x2"/>
      </value-group>
      <value-group caption="" name="RTC_MR__OUT0">
        <value caption="No waveform, stuck at '0'" name="NO_WAVE" value="0x0"/>
        <value caption="1 Hz square wave" name="FREQ1HZ" value="0x1"/>
        <value caption="32 Hz square wave" name="FREQ32HZ" value="0x2"/>
        <value caption="64 Hz square wave" name="FREQ64HZ" value="0x3"/>
        <value caption="512 Hz square wave" name="FREQ512HZ" value="0x4"/>
        <value caption="Output toggles when alarm flag rises" name="ALARM_TOGGLE" value="0x5"/>
        <value caption="Output is a copy of the alarm flag" name="ALARM_FLAG" value="0x6"/>
        <value caption="Duty cycle programmable pulse" name="PROG_PULSE" value="0x7"/>
      </value-group>
      <value-group caption="" name="RTC_MR__OUT1">
        <value caption="No waveform, stuck at '0'" name="NO_WAVE" value="0x0"/>
        <value caption="1 Hz square wave" name="FREQ1HZ" value="0x1"/>
        <value caption="32 Hz square wave" name="FREQ32HZ" value="0x2"/>
        <value caption="64 Hz square wave" name="FREQ64HZ" value="0x3"/>
        <value caption="512 Hz square wave" name="FREQ512HZ" value="0x4"/>
        <value caption="Output toggles when alarm flag rises" name="ALARM_TOGGLE" value="0x5"/>
        <value caption="Output is a copy of the alarm flag" name="ALARM_FLAG" value="0x6"/>
        <value caption="Duty cycle programmable pulse" name="PROG_PULSE" value="0x7"/>
      </value-group>
      <value-group caption="" name="RTC_MR__THIGH">
        <value caption="31.2 ms" name="H_31MS" value="0x0"/>
        <value caption="15.6 ms" name="H_16MS" value="0x1"/>
        <value caption="3.91 ms" name="H_4MS" value="0x2"/>
        <value caption="976 us" name="H_976US" value="0x3"/>
        <value caption="488 us" name="H_488US" value="0x4"/>
        <value caption="122 us" name="H_122US" value="0x5"/>
        <value caption="30.5 us" name="H_30US" value="0x6"/>
        <value caption="15.2 us" name="H_15US" value="0x7"/>
      </value-group>
      <value-group caption="" name="RTC_MR__TPERIOD">
        <value caption="1 second" name="P_1S" value="0x0"/>
        <value caption="500 ms" name="P_500MS" value="0x1"/>
        <value caption="250 ms" name="P_250MS" value="0x2"/>
        <value caption="125 ms" name="P_125MS" value="0x3"/>
      </value-group>
      <value-group caption="" name="RTC_SR__ACKUPD">
        <value caption="Time and calendar registers cannot be updated." name="FREERUN" value="0"/>
        <value caption="Time and calendar registers can be updated." name="UPDATE" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__ALARM">
        <value caption="No alarm matching condition occurred." name="NO_ALARMEVENT" value="0"/>
        <value caption="An alarm matching condition has occurred." name="ALARMEVENT" value="1"/>
      </value-group>
